Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_FoundationLibraryRef/FoundationLibraryReference-level2.tmx
Source language: en_us
Languages: ja

source: Comparing Character Sets
ja: 文字集合を比較する

source: Comparing Data
ja: データを比較する

source: Comparing Date Components
ja: 日付構成要素を比較します

source: Comparing Date Intervals
ja: 日付間隔を比較する

source: Comparing Dates
ja: 日付を比較する

source: Comparing Decimals
ja: 10進数を比較する

source: Comparing Dictionaries
ja: 辞書の比較

source: Comparing Hosts
ja: ホストを比較する

source: Comparing Index Paths
ja: インデックスパスを比較する

source: Comparing Index Sets
ja: インデックス集合を比較する

source: Comparing Indexes
ja: インデックスを比較する

source: Comparing Range Views
ja: 範囲ビューを比較する

source: Comparing Sets
ja: 集合を比較する

source: Comparing Transforms
ja: 変換を比較する

source: Comparison determinants
ja: 比較決定要素

source: Compiles the receiver before executing it if it is not already compiled.
ja: レシーバを、それがまだコンパイルされないならば、それの実行の前にコンパイルします。

source: Compiles the receiver, if it is not already compiled.
ja: それがまだコンパイルされないならば、レシーバをコンパイルします。

source: Compiling and Executing a Script
ja: スクリプトのコンパイルと実行

source: Complexity: O(1)
ja: 計算量：O(1)

source: Complexity: O(1) if the collection conforms to Random Access Collection; otherwise, O(n), where n is the absolute value of n.
ja: 計算量：O(1)、もしコレクションがRandom Access Collectionに準拠するならば；そうでなければ、O(n)、そこでnはnの値の絶対値です。

source: Complexity: O(1) if the collection conforms to Random Access Collection; otherwise, O(n), where n is the length of the collection.
ja: 計算量：コレクションがRandom Access Collectionに準拠するならば、O(1)；そうでなければ、O(n)、そこでnはコレクションの長さです。

source: Complexity: O(1) if the collection conforms to Random Access Collection; otherwise, O(n), where n is the resulting distance.
ja: 計算量：O(1)、もしコレクションがRandom Access Collectionに準拠するならば；そうでなければ、O(n)、そこでnは結果となる隔たりです。

source: Complexity: O(1) if the collection conforms to Random Access Collection; otherwise, O(n).
ja: 計算量：O(1) コレクションがRandom Access Collectionに準拠するならば；そうでなければ、O(n)。

source: Complexity: O(1) on average, over many additions to the same collection.
ja: 計算量：同じコレクションへの多くの追加に対して、均してO(1)。

source: Complexity: O(1).
ja: 計算量：O(1)。

source: Complexity: O(m + n), where m is the length of this sequence and n is the length of the result.
ja: 計算量：O(m + n)、ここでmはこのシーケンスの長さで、nは結果の長さです。

source: Complexity: O(m), where m is the combined length of the collection and new Elements.
ja: 計算量：O(n)、ここでnはコレクションとnew Elementsを合わせた長さです。

source: Complexity: O(n)
ja: 計算量：O(n)

source: Complexity: O(n), where n is equal to max Length.
ja: 計算量：O(n)、ここでnはmax Lengthと等しいです。

source: Complexity: O(n), where n is the length of the collection.
ja: 計算量：O(n)、ここでnはコレクションの長さです。

source: Complexity: O(n), where n is the length of the resulting collection.
ja: 計算量：O(n)、ここでnは結果となるコレクションの長さです。

source: Complexity: O(n), where n is the length of the sequence.
ja: 計算量：O(n)、ここでnはシーケンスの長さです。

source: Complexity: O(n), where n is the number of elements in the collection.
ja: 計算量：O(n)、ここでnはコレクションの中の要素数です。

source: Complexity: O(n), where n is the number of elements to drop from the beginning of the collection.
ja: 計算量：O(n)、ここでnはコレクションの始まりから省かれる要素の数です。

source: Complexity: O(n), where n is the number of elements to drop.
ja: 計算量：O(n)、ここでnは省く要素の数です。

source: Complexity: O(n), where n is the specified number of elements.
ja: 計算量：O(n)、ここでnは指定された要素の数です。

source: Computes the dates which match (or most closely match) a given set of components, and calls the closure once for each of them, until the enumeration is stopped.
ja: 与えられた一揃いの構成要素と合致する（または最も近くの合致する）日付それらを計算します、そしてそれらの各々で一度だけクロージャを呼び出します、列挙が停止されるまで。

source: Computes the next date which matches (or most closely matches) a given set of components.
ja: 与えられた一揃いの構成要素に合致する（または最も近くの合致する）次の日付を計算します。

source: Concatenation is performed by matrix multiplication—see Manipulating Transform Values.
ja: 連結は、行列の乗法によって実行されます—「Manipulating Transform Values」を見てください。

source: Concurrency and Thread Safety
ja: 並列性とスレッド安全

source: Configures the strings to use (if any) for unit names such as days, hours, minutes, and seconds.
ja: 文字列を配列して、日、時、分、そして秒などの単位名に（もしあれば）使ってください。

source: Configuring a formatter object
ja: フォーマッタオブジェクトの構成設定

source: Configuring the Formatter
ja: フォーマッタを構成設定する

source: Configuring the Formatter Options
ja: フォーマッタオプションを構成設定する

source: Conforms To
ja: 次に準拠

source: Connecting to the iCloud servers failed.
ja: iCloudサーバーへの接続が失敗しました。

source: Consider a Landmark structure that stores the name and founding year of a landmark:
ja: 歴史的建築物の名前と建造年を格納するLandmark構造体を考えてください：

source: Constant that defines the name of a file operation exception.
ja: ファイル操作例外の名前を定義する定数。

source: Constants
ja: 定数

source: Constants describing the CPU types that a bundle’s executable code supports.
ja: バンドルの持つ実行可能コードをがサポートするCPU型を記述している定数。

source: Constants for specifying how to represent quantities of time.
ja: 時間量をどうやって表すか指定するための定数。

source: Constants indicating the relationship between a directory and an item.
ja: あるディレクトリとある項目の間の関係を指し示す定数。

source: Constants such as k Auto Generate Return ID and k Any Transaction ID are defined in AE .framework, a subframework of Application Services .framework.
ja: k Auto Generate Return IDとk Any Transaction IDのような定数は、Application Services .frameworkの下位フレームワーク、AE .frameworkにおいて定義されます。

source: Constants that indicate sort order.
ja: ソート順を指し示す定数。

source: Constants that specify the behavior NSDate Formatter should exhibit.
ja: NSDate Formatterが発揮すべき挙動を指定する定数。

source: Constants used to control behavior when allocating or reallocating collectible memory.
ja: コレクション可能なメモリをアロケートまたは再アロケートする時挙動を制御するのに使われる定数。

source: Containers that want to evaluate some specifiers on their own should implement this method.
ja: いくつかの指定子をそれら自身上で評価することを望むコンテナは、このメソッドを実装するべきです。

source: Contents for the new regular-file file wrapper.
ja: 新しい通常ファイルラッパーに対する内容。

source: Contents of the file.
ja: ファイルの内容。

source: Control how URL requests make use of previously cached data.
ja: URLリスクエストがキャッシュされたデータを利用する方法を制御します。

source: Control the behavior of "^" and "$" in a pattern.
ja: パターンで「^」と「$」の挙動を制御します。

source: Controls the behavior of \b in a pattern.
ja: パターンで\bの挙動を制御します。

source: Conventionally this is a terminal device on which the user enters a stream of data.
ja: 慣例的にこれは、それの上でユーザがデータのストリームを記入するターミナルデバイスです。

source: Conventionally this is a terminal device that receives a stream of data from a program.
ja: 慣例的にこれは、プログラムからのデータのストリームを受け取るターミナルデバイスです。

source: Conventionally this is a terminal device to which error messages are sent.
ja: 慣例的にこれは、それに対してエラーメッセージが送られるターミナルデバイスです。

source: Conversely, declare conformance to Decodable if you only need to read data of a given type.
ja: 反対に、Decodableへの準拠を、あなたが与えられた型のデータを読み込みのみを必要とするならば宣言してください。

source: Conversely, if you want to show only the time, you would set the date Style property to none and the time Style property to short.
ja: 逆に言えば、あなたが時間だけを示すことを望むならば、あなたはdate Styleプロパティをnoneに、そしてtime Styleプロパティをshortに設定するでしょう。

source: Convert cookies to request headers
ja: クッキーをリクエストヘッダに変換する

source: Convert numbers, dates, measurements, and other values to and from locale-aware string representations.
ja: 数字、日付、寸法、および他の値を現地通用文字列表現へと、そしてそれから変換します。

source: Convert objects and values to and from property list, JSON, and other flat binary representations.
ja: オブジェクトと値をプロパティリスト、JSON、そして平坦なバイナリ表現へとおよびそれから変換します。

source: Converting Between Decimals and Strings
ja: 10進数と文字列の間で変換する

source: Converting File Paths to Strings
ja: ファイルパスを文字列へ変換する

source: Converting ISO 8601 Dates
ja: ISO 8601日付を変換する

source: Converting Objects
ja: オブジェクト変換

source: Converts a byte count into a string without creating an NSNumber object.
ja: あるバイト計数を文字列へ変換します、NSNumberオブジェクトの作成なしにです。

source: Converts a byte count into the specified string format without creating an NSNumber object.
ja: あるバイト計数を指定された文字列書式へ変換します、NSNumberオブジェクトの作成なしにです。

source: Converts the big-endian value in x to the current endian format and returns the resulting value.
ja: xの中のビッグエンディアン値を現在のエンディアン形式に変換して、結果の値を返します。

source: Converts the double value in x to a value whose bytes can be swapped.
ja: xの中のダブル値を、それのバイトがスワップできるある値に変換します。

source: Converts the float value in x to a value whose bytes can be swapped.
ja: xの中のフロート値を、それのバイトがスワップできるある値に変換します。

source: Converts the little-endian formatted value in x to the current endian format and returns the resulting value.
ja: xの中のリトルエンディアン形式の値を現在のエンディアン形式に変換して、結果の値を返します。

source: Converts the value in x to a double value.
ja: xの中の値をダブル値に変換します。

source: Converts the value in x to a float value.
ja: xの中の値をフロート値に変換します。

source: Converts the value in x, specified in the current endian format, to big-endian format and returns the resulting value.
ja: xの中の、現在のエンディアン形式で指定された値を、ビッグエンディアン形式に変換します、そして結果の値を返します。

source: Converts the value in x, specified in the current endian format, to little-endian format and returns the resulting value.
ja: xの中の、現在のエンディアン形式で指定された値を、リトルエンディアン形式に変換します、そして結果の値を返します。

source: Converts to: base Uri
ja: 次に変換：base Uri

source: Converts to: fee Fi Fo Fum
ja: 次に変換：fee Fi Fo Fum

source: Cookies
ja: さまざまなクッキー

source: Cookies are not shared among applications in iOS.
ja: クッキーは、iOSではアプリケーション間で共有されません。

source: Cookies marked as such must only be sent via HTTP Headers in HTTP requests for URL's that match both the path and domain of the respective cookies.
ja: そのように印されるクッキーは、それぞれのクッキーのパスとドメインの両方にマッチするURLに対するHTTPリクエストにおいてHTTPヘッダ経由でのみ送られなければなりません。

source: Cookies may be marked as HTTP only by a server (or by a javascript).
ja: クッキーは、サーバーによって（またはjavascriptによって）HTTP専用として印されるかもしれません。

source: Cookies specified as HTTP only should not be delivered to any javascript applications to prevent cross-site scripting vulnerabilities.
ja: HTTP専用として指定されるクッキーは、何らかのjavascriptアプリケーションに配達されるべきではありません、クロスサイトスクリプティング脆弱性を予防するためです。

source: Copies (or copies on write) byte Count bytes from source to destination.
ja: byte Countバイトをsourceからdestinationへとコピー（またはコピーオンライト）します。

source: Copies a block of memory.
ja: メモリのブロックをコピーします。

source: Copies a subset of the contents of the data to memory.
ja: データの内容のサブセットをメモリにコピーします。

source: Copies all the objects contained in the array to a Buffer.
ja: 配列のすべてのオブジェクトをa Bufferにコピーします。

source: Copies the bytes in a range from the data into a buffer.
ja: データからある範囲のバイトをバッファにコピーします。

source: Copies the contents of the data to memory.
ja: データの内容をメモリにコピーします。

source: Copies the file at the specified URL to a new location synchronously.
ja: 指定されたURLでファイルを新しい場所に非同期にコピーします。

source: Copies the item at the specified path to a new location synchronously.
ja: 指定されたパスでファイルを新しい場所に非同期にコピーします。

source: Copies the objects contained in the array that fall within the specified range to a Buffer.
ja: この配列に含まれるオブジェクトで、指定された範囲内に収まるものをa Bufferにコピーします。

source: Copies the value in source to destination.
ja: sourceの中の値をdestinationにコピーします。

source: Copies the value of a decimal number.
ja: 10進数の値をコピーします。

source: Copying an Item
ja: 項目のコピー

source: Counting Bytes
ja: バイトを数える

source: Counting Indexes
ja: インデックスを数える

source: Counting Items in a Set
ja: 集合の中の項目を数える

source: Counting Nodes
ja: ノードを数える

source: Create a bundle object for the intended bundle directory.
ja: 意図するバンドルディレクトリのためにバンドルオブジェクトを作成する。

source: Create an instance initialized to value.
ja: valueに初期化されるインスタンスを作成します。

source: Create and process strings of Unicode characters, use regular expressions to find patterns, and perform natural language analysis of text.
ja: ユニコード文字からなる文字列を作成および処理します、正規表現を使ってパターンを見つけます、そしてテキストの自然言語解析を実行します。

source: Create cookie instances
ja: クッキーインスタンスを作成する

source: Create, read, write, and examine files and folders in the file system.
ja: ファイルシステムにおいてファイルとフォルダの作成、読み込み、書き出し、そして調査をします。

source: Creates a data buffer with copied memory content using a buffer pointer.
ja: バッファポインタを使ってコピーされたメモリ内容で、データバッファを作成します。

source: Creates a data buffer with copied memory content using a mutable buffer pointer.
ja: 可変バッファポインタを使って、データバッファをコピーされたメモリ内容で作成します。

source: Creates a data buffer with memory content without copying the bytes.
ja: バイトをコピーすることなしに、データパッファをメモリ内容で作成します。

source: Creates a data buffer with the contents of a URL.
ja: あるURLの内容で、新しいデータバッファを作成します。

source: Creates a date value initialized relative to 00:00:00 UTC on 1 January 1970 by a given number of seconds.
ja: 与えられた秒数だけ00:00:00 UTC 1 January 1970に相対して初期化される日付値を作成します。

source: Creates a date value initialized relative to 00:00:00 UTC on 1 January 2001 by a given number of seconds.
ja: 与えられた秒数だけ00:00:00 UTC 1 January 2001に相対して初期化される日付値を作成します。

source: Creates a date value initialized relative to another given date by a given number of seconds.
ja: 与えられた秒数だけ別の与えられた日付に相対して初期化される日付値を作成します。

source: Creates a date value initialized relative to the current date and time by a given number of seconds.
ja: 与えられた秒数だけ現在の日付と時刻に相対して初期化される日付値を作成します。

source: Creates a date value initialized to the current date and time.
ja: 現在の日付と時刻に初期化される日付値を作成します。

source: Creates a decimal initialized according to the provided characteristics.
ja: 提供された特徴に従って初期化される10進数を作製します。

source: Creates a decimal initialized to 0.
ja: 0に初期化される10進数を作成します。

source: Creates a decimal initialized with the given sign, exponent, and significand.
ja: 与えられた符号、指数、そして仮数を使って初期化される10進数を作製します。

source: Creates a descriptor initialized with Apple event type type SInt32 that stores the specified integer value.
ja: アップルイベント型type SInt32で初期化される記述子を作成します、それは指定された整数値を格納します。

source: Creates a descriptor initialized with the specified event type that stores the specified data (from a series of bytes).
ja: 指定されたイベント型で初期化される記述子を作成します、それは指定されたデータを格納します（一続きのバイトから）。

source: Creates a descriptor initialized with the specified event type that stores the specified data (from an instance of NSData).
ja: 指定されたイベント型で初期化される記述子を作成します、それは指定されたデータを格納します（NSDataのインスタンスから）。

source: Creates a descriptor initialized with type type Boolean that stores the specified Boolean value.
ja: 型type Booleanで初期化される記述子を作成します、それは措定されたブール値を格納します。

source: Creates a descriptor initialized with type type Enumerated that stores the specified enumerator data type value.
ja: 型type Enumeratedで初期化される記述子を作成します、それは指定された列挙子データ型値を格納します。

source: Creates a descriptor initialized with type type Type that stores the specified type value.
ja: type Type型で初期化される記述子を作成します、それは指定された型値を格納します。

source: Creates a descriptor initialized with type type Unicode Text that stores the text from the specified string.
ja: type Unicode Text型で初期化される記述子を作成します、それは指定された文字列からのテキストを格納します。

source: Creates a descriptor that represents an Apple event, initialized according to the specified information.
ja: あるアップルイベントを表す記述子を作成します、指定の情報に従って初期化されます。

source: Creates a directory (without contents) at a given path with given attributes.
ja: 辞書を（内容無しで）与えられたパスで、いくらかの与えられた属性とともに作成します。

source: Creates a directory with given attributes at the specified path.
ja: 与えられた属性を持つディレクトリを指定されたパスで作成します。

source: Creates a directory with the given attributes at the specified URL.
ja: 与えられた属性を持つディレクトリを指定されたURLで作成します。

source: Creates a file with the specified content and attributes at the given location.
ja: 指定された内容と属性でファイルを与えられた場所で作成します。

source: Creates a file wrapper from a given file-system node and adds it to the receiver, which must be a directory file wrapper.
ja: ファイルラッパーをある与えられたファイルシステムノードから作成してそれをレシーバに加えます、それはディレクトリファイルラッパーでなければなりません。

source: Creates a hard link between the items at the specified URLs.
ja: 指定されたURLでの項目それらの間のハードリンクを作成します。

source: Creates a hard link between the items at the specified paths.
ja: 指定されたパスでの項目それらの間のハードリンクを作成します。

source: Creates a list of directory search paths.
ja: ディレクトリ検索パスのリストを作成します。

source: Creates a new NSPoint from the specified values.
ja: 新しいNSPointを指定された値から作成します。

source: Creates a new NSRect from the specified values.
ja: 新しいNSRectを、指定された値から作成します。

source: Creates a new NSRange from the specified values.
ja: 新しいNSRangeを指定された値から作成します。

source: Creates a new calendar instance by decoding from the given decoder.
ja: 新しいカレンダーインスタンスを与えられたデコーダからデコーディングすることによって作成します。

source: Creates a new calendar.
ja: 新しいカレンダーを作成します。

source: Creates a new collection containing the specified number of a single, repeated value.
ja: 指定された数の、ある単一の値の繰り返しを含んでいる新しいコレクションを作成します。

source: Creates a new data buffer by adopting a reference type.
ja: 参照型を採用することによって、新しいデータバッファを作成します。

source: Creates a new data buffer from Base-64, UTF-8 encoded data.
ja: 新しいデータバッファをBase-64、UTF-8エンコードされたデータから作成します。

source: Creates a new data buffer from a Base-64 encoded string using the given options.
ja: 新しいデータバッファをBase-64エンコードされた文字列から作成します、与えられたオプションを使います。

source: Creates a new data buffer with the contents of an array slice.
ja: ある配列スライスの内容で、新しいデータバッファを作成します。

source: Creates a new data buffer with the contents of an array.
ja: ある配列の内容で、新しいデータバッファを作成します。

source: Creates a new data buffer with the specified count of zeroed bytes.
ja: 指定された数のゼロのバイトで、新しいデータバッファを作成します。

source: Creates a new date value by adding a time interval to this date.
ja: ある時間間隔をこの日付に加えることによって新しい日付値を作成します。

source: Creates a new decimal value by decoding from the given decoder.
ja: 新しい10進値を与えられたデコーダからデコーディングすることによって作成します。

source: Creates a new decimal value exactly representing the provided integer.
ja: 提供された整数を正確に表している新しい10進値を作成します。

source: Creates a new hash table in a given zone.
ja: 新しいハッシュテーブルを、与えられたゾーンに作成します。

source: Creates a new instance of a collection containing the elements of a sequence.
ja: あるシーケンスの要素を含んでいるあるコレクションの新しいインスタンスを作成します。

source: Creates a new map table in the default zone.
ja: 新しいマップテーブルを、省略時のゾーンの中に作成します。

source: Creates a new map table in the specified zone.
ja: 新しいマップテーブルを、指定されたゾーンの中に作成します。

source: Creates a new set from a finite sequence of items.
ja: いくつかの要素からなる有限のシーケンスから集合を作成します。

source: Creates a new, reusable JSON decoder with the default formatting settings and decoding strategies.
ja: 新しい、再利用可能なJSONデコーダを省略時の書式設定の設定とデコーディング戦略で作成します。

source: Creates a new, reusable JSON encoder with the default formatting settings and encoding strategies.
ja: 新しい、再利用可能なJSONエンコーダを省略時の書式設定の設定とエンコーディング戦略で作成します。

source: Creates a notification with information and an immediate-delivery specifier, and posts it to the receiver.
ja: 通知を情報および即時配達指定子とともに作成します、そしてそれをレシーバに投函します。

source: Creates a notification with information, and posts it to the receiver.
ja: 通知を情報とともに作成します、そしてそれをレシーバに投函します。

source: Creates a notification, and posts it to the receiver.
ja: 通知を作成して、それをレシーバに投函します。

source: Creates a regular-file file wrapper with the given contents and adds it to the receiver, which must be a directory file wrapper.
ja: 与えられた内容を持つ通常ファイルファイルラッパーを作成してそれをレシーバに加えます、それはディレクトリファイルラッパーでなければなりません。

source: Creates a representation of the specified date with a given time zone and format options.
ja: 指定された日付の表現を、ある与えられたタイムゾーンと書式設定オプションで作成します。

source: Creates a set containing the elements of the given array literal.
ja: 与えられた配列リテラルの要素を含んでいる集合を作成します。

source: Creates a symbolic link at the specified URL that points to an item at the given URL.
ja: 指定されたURLでシンボリックリンクを作成します、それは与えられたURLでの項目を指し示します。

source: Creates a symbolic link identified by path that refers to the location other Path in the file system.
ja: pathによって識別されるシンボリックリンクを作成します、それは場所other Pathをファイルシステムにおいて参照します。

source: Creates a symbolic link identified by a given path that refers to a given location.
ja: 与えられたパスによって識別されるシンボリックリンクを作成します、それは与えられた場所に言及します。

source: Creates a symbolic link that points to the specified destination.
ja: 指定された目的地を指すシンボリックリンクを作成します。

source: Creates a symbolic-link file wrapper pointing to a given file-system node and adds it to the receiver, which must be a directory file wrapper.
ja: ある与えられたファイルシステムノードを指すシンボリックリンクファイルラッパーを作成してそれをレシーバに加えます、それはディレクトリファイルラッパーでなければなりません。

source: Creates an NSRegularExpression instance with the specified regular expression pattern and options.
ja: 指定された正規表現パターンとオプションでNSRegularExpressionインスタンスをつくります。

source: Creates an affine transformation matrix from a rotation value (angle in degrees).
ja: アフィン変換マトリックスを回転値（度数での角度）から作成します。

source: Creates an affine transformation matrix from rotation value (angle in radians).
ja: アフィン変換マトリックスを回転値（ラジアンでの角度）から作成します。

source: Creates an affine transformation matrix from scaling a single value.
ja: アフィン変換マトリックスをただ１つの値を拡大縮小することから作成します。

source: Creates an affine transformation matrix from scaling values.
ja: アフィン変換マトリックスをいくつかの値を拡大縮小することから作成します。

source: Creates an affine transformation matrix from translation values.
ja: アフィン変換マトリックスを平行移動値から作成します。

source: Creates an affine transformation matrix with identity values.
ja: アフィン変換マトリックスを恒等値から作成します。

source: Creates an affine transformation.
ja: あるアフィン変換を作成します。

source: Creates an empty data buffer of a specified size.
ja: 指定されたサイズの空のデータバッファを作成します。

source: Creates an empty data buffer.
ja: 空のデータバッファを作成します。

source: Creates an empty index path.
ja: 空のインデックスパスを作成します。

source: Creates an empty option set.
ja: 空のオプションセットを作成します。

source: Creates an enumerator for the specified hash table.
ja: 指定されたハッシュテーブルのための列挙子を作成します。

source: Creates an enumerator for the specified map table.
ja: 指定されたマップテーブルのための列挙子を作成します。

source: Creates an exact copy of an object.
ja: あるオブジェクトの厳密コピーを作成します。

source: Creates an index path from a sequence of integers.
ja: いくつかの整数の連なりからインデックスパスを作成します。

source: Creates an index path from an array literal.
ja: 配列リテラルからインデックスパスを作成します。

source: Creates an index path from an array of elements.
ja: 要素からなる配列からインデックスパスを作成します。

source: Creates an index path that references a row in a particular section.
ja: ある列を特定のセクションにおいて参照するインデックスパスを作成します。

source: Creates an index path that references an item in a particular section.
ja: ある項目を特定のセクションにおいて参照するインデックスパスを作成します。

source: Creates an index path with a single element.
ja: ただ１つの要素をもつインデックスパスを作成します。

source: Creates and initializes a decimal by interpreting the provided string.
ja: 提供された文字列を解釈することによって10進数を作成する。

source: Creates and initializes a decimal with the provided floating point value.
ja: 提供された浮動小数点数を使って、10進数を作成して初期化します。

source: Creates and initializes a decimal with the provided integer value.
ja: 提供された整数値で10進数を作成して初期化します。

source: Creates and initializes a decimal with the provided unsigned integer value.
ja: 提供された符号なし整数値で10進数を作成して初期化します。

source: Creates and initializes a decimal with the sign and magnitude of the given decimals.
ja: 与えられた10進数の符号と規模を使って、10進数を作成して初期化します。

source: Creates and initializes a descriptor for an Apple event record whose data has yet to be set.
ja: あるアップルイベントレコードに対する記述子を作成して初期化します、それのデータはまだ設定されません。

source: Creates and initializes a descriptor with no parameter or attribute values set.
ja: パラメータまたは属性値が設定されない記述子を作成して初期化します。

source: Creates and initializes an empty list descriptor.
ja: 空のリスト記述子を作成して初期化します。

source: Creates and posts a notification.
ja: 通知を作成して投函します。

source: Creates and returns a date object from the specified ISO 8601 formatted string representation.
ja: 指定されたISO 8601書式設定された文字列表現から日付オブジェクトを作成して返します。

source: Creates and returns a file URL for the resource with the specified name and extension in the specified bundle.
ja: 指定されたバンドルにおいて、指定された名前と拡張子を持つリソースに対するファイルURLを作成して返します。

source: Creates and returns a new NSBezier Path object with each point in the given path transformed by the receiver.
ja: レシーバによって変換された指定パスの各ポイントを使って新しいNSBezier Pathオブジェクトを作成して返します。

source: Creates and returns a new hash table.
ja: 新しいハッシュテーブルを作成して返します。

source: Creates and returns a new instance of a given class.
ja: 与えられたクラスのある新しいインスタンスを作成して返します。

source: Creates and returns a pointer to an NSMap Table structure in the default zone; the table’s size is dependent on (but generally not equal to) capacity.
ja: 省略時のゾーンの中のNSMap Table構造体へのポインタを作成して返します；テーブルのサイズはcapacityに依存します（しかし一般的に等しくはありません）。

source: Creates and returns a text checking result with the specified URL.
ja: 指定されたURLを使ったテキストチェックの結果を作成して返します。

source: Creates and returns a text checking result with the specified replacement string.
ja: 指定された置き換え文字列を使ったテキストチェックの結果を作成して返します。
